programming/golang/how-to-write-go-code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-10 Sat 23:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Note on "How to write go code"</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="/diary/style/style.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Note on "How to write go code"</h1>
</header>
<div id="outline-container-orgf02b822" class="outline-2">
<h2 id="orgf02b822">代码组织</h2>
<div class="outline-text-2" id="text-orgf02b822">
</div><div id="outline-container-org9d9184f" class="outline-3">
<h3 id="org9d9184f">目录结构</h3>
<div class="outline-text-3" id="text-org9d9184f">
<ul class="org-ul">
<li>workspace
<ul class="org-ul">
<li>repositories(版本库)
<ul class="org-ul">
<li>packages（包）
<ul class="org-ul">
<li>go source files</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org66b5678" class="outline-3">
<h3 id="org66b5678">关系</h3>
<div class="outline-text-3" id="text-org66b5678">
<ul class="org-ul">
<li>包目录决定了导入路径 ( import path )</li>
</ul>
</div>
</div>


<div id="outline-container-org7b0a667" class="outline-3">
<h3 id="org7b0a667">Workspace</h3>
<div class="outline-text-3" id="text-org7b0a667">
</div><div id="outline-container-orgc9bf760" class="outline-4">
<h4 id="orgc9bf760">目录</h4>
<div class="outline-text-4" id="text-orgc9bf760">
<p>
包含三级目录
</p>

<ol class="org-ol">
<li><b>src</b> contains Go source files</li>
<li><b>pkg</b> contains package objects</li>
<li><b>bin</b> contains executable commands</li>
</ol>
</div>
</div>

<div id="outline-container-org76e53c5" class="outline-4">
<h4 id="org76e53c5">关系</h4>
<div class="outline-text-4" id="text-org76e53c5">
<ul class="org-ul">
<li>go tool 从 src 中编译包，生成二进制到 pkg 和 bin</li>
<li>src 目录下有多个子 package，每个 package 可以有独立的版本管理（repositories）</li>
</ul>
</div>
</div>
</div>
</div>





<div id="outline-container-org243774c" class="outline-2">
<h2 id="org243774c">GOPATH</h2>
<div class="outline-text-2" id="text-org243774c">
<ul class="org-ul">
<li>用于设定 workspace 的位置</li>
<li>默认为 <code>${HOME}/go</code></li>
<li><b>不能</b> 与 GO 安装位置重复</li>
<li>通过 <code>go env GOPATH</code> 查看当前 GOPATH 设置</li>
<li>为了方便运行，可以加入 PATH： <code>export PATH=$PATH:$(go env GOPATH)/bin</code></li>
<li>通过 <code>go help gopath</code> 查看帮助</li>
</ul>
</div>

<div id="outline-container-orga0ca377" class="outline-3">
<h3 id="orga0ca377"><span class="todo TODO">TODO</span> GOROOT</h3>
</div>
</div>

<div id="outline-container-orga79cc33" class="outline-2">
<h2 id="orga79cc33">Import Paths</h2>
<div class="outline-text-2" id="text-orga79cc33">
<ul class="org-ul">
<li>字符串，标识一个包</li>
<li>导入路径与包在 workspace 中的目录一致</li>
<li>可以是一个远程仓库</li>
<li>注意起名的惯例，如 <code>github.com/larryzju/xxx</code> ，以免重复</li>
</ul>
</div>
</div>



<div id="outline-container-org9f86678" class="outline-2">
<h2 id="org9f86678">编译和运行</h2>
<div class="outline-text-2" id="text-org9f86678">
</div><div id="outline-container-org15840f2" class="outline-3">
<h3 id="org15840f2">步骤</h3>
<div class="outline-text-3" id="text-org15840f2">
<ol class="org-ol">
<li>设定 GOPATH</li>
<li>创建 package 目录</li>
<li>编程</li>
<li>使用 <code>go install &lt;github.com/larry/package-name&gt;</code> 生成(可以在任意路径)</li>
<li>生成结果位于 <code>$WORKSPACE/{bin,pkg}</code> （视是否可执行而定）</li>
<li>[OPTIONAL] 版本管理 package（在包的最终目录下，不需要整个路径）</li>
</ol>
</div>
</div>


<div id="outline-container-orge131fbc" class="outline-3">
<h3 id="orge131fbc">注意</h3>
<div class="outline-text-3" id="text-orge131fbc">
<ul class="org-ul">
<li>设定 GOPATH， <code>go install &lt;package-path&gt;</code> 可以在任意路径下进行</li>
<li>如果已经在当前包的最终目录下，可以直接 <code>go install</code></li>
<li>可以使用 <code>go build</code> 编译; <code>go install</code> 包含 build，同时生成文件</li>
<li>go 生成的可执行文件是静态链接，可独立运行</li>
</ul>
</div>
</div>


<div id="outline-container-org81f25d8" class="outline-3">
<h3 id="org81f25d8">问题</h3>
<div class="outline-text-3" id="text-org81f25d8">
</div><div id="outline-container-orgfd87aa9" class="outline-4">
<h4 id="orgfd87aa9"><span class="todo TODO">TODO</span> 如何实现跨平台编译</h4>
</div>
</div>
</div>

<div id="outline-container-orgcd96aca" class="outline-2">
<h2 id="orgcd96aca">Package names</h2>
<div class="outline-text-2" id="text-orgcd96aca">
<ul class="org-ul">
<li>package name 是导入后被调用时写的名称</li>
<li>all files in a package must use the same name.</li>
<li>惯例是以导入路径的最后一个元素作为包名</li>
<li>可执行命令包名必须为 <code>main</code></li>
<li>生成的二进制文件中不需要担心包名重复（Why？），但需要保护导入路径唯一</li>
</ul>
</div>
</div>







<div id="outline-container-org6527336" class="outline-2">
<h2 id="org6527336">Testing</h2>
<div class="outline-text-2" id="text-org6527336">
<ul class="org-ul">
<li><code>go test</code> 命令和 <code>testing</code> 包</li>
<li>文件命名以 <code>_test.go</code> 为后缀，并以 <code>func TestXXX( t *testing.T )</code> 来写测试函数</li>
<li>使用 <code>go help test</code> 来查看帮助</li>
</ul>
</div>
</div>




<div id="outline-container-org7dea238" class="outline-2">
<h2 id="org7dea238">Remote Packages</h2>
<div class="outline-text-2" id="text-org7dea238">
<ul class="org-ul">
<li>使用 <code>go get</code> 来获取远程包</li>
<li>默认获取到 <code>GOPATH</code> 路径下</li>
<li>使用 <code>go help importpath</code> 来查看帮助</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2017-06-10 Sat 23:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
